# [1]
# Дана довільна строка.
# Напишіть код, який знайде в ній і віведе на екран кількість слів, які містять дві голосні літери підряд.


words_request = input('Введіть ваш текст українською: ')

#  Преобразовываю фраазу в list, чтобы каждое слово было элементом
words_list = words_request.split()

# лист со всеми гласными укр буквами
vowels_list = ['а', 'е', 'и', 'і', 'о', 'у', 'я', 'ю', 'є', 'ї']

# циклом перебираю слова на наличие 2 гласных подряд и добавляю в новый лист
vowels_word = list()

for word in words_list:
    counter = 0
    for letter in word:
        if letter in vowels_list:
            counter += 1
        else:
            counter = 0

        if counter == 2:
            vowels_word.append(word)

# Вывожу количество слов в листе с 2мя гласными подряд
print(len(vowels_word))


# Фраза - пример для проверки работы кода
# Приголосні звуки – це звуки, що творяться за допомогою голосу й шуму або лише шуму. При їх вимові струмінь видихуваного повітря натрапляє на різні перепони органів мовлення (наприклад, язик, зуби, губи), унаслідок чого виникають шуми, які є основою саме приголосних звуків.